package com.javarush.module2.lesson04;
public interface Data {
    String TEXT= """
            ООП: инкапсуляция, полиморфизм
            ООП: перегрузка, переопределение, абстрактные классы
            Дополнительное занятие (ООП: композиция, агрегация, наследование)
            ООП: интерфейсы
            Generics
            Лямбда-функции
            Приведение типов
            Особенности вызова конструкторов. Блок static
            Устройство класса Object
            Дополнительное занятие (Рекурсия)
            Знакомство с нитями
            Знакомство с нитями ч.2
            Executor
            Thread pool
            Внутренние/Вложенные классы
            Дополнительное занятие (Сериализация)
            Reflection API
            Аннотации в Java
            Sockets
            Итоговый проект
            """;
}
